diary/2024-09-01.html
<!doctype html>
<html lang="ja">
  <head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>ABC 369 - toybeam</title>
    <meta name="description" content="devlog of toyboot4e" />
    <link rel="stylesheet" href="/style/simple.min.css" />
    <link rel="stylesheet" href="/style/style.css" />
    <link rel="stylesheet" href="/style/prism.css" />
    <!-- MathJax -->
  </head>
  <body>
    <header role="banner">
      <h1>ABC 369</h1>
      <p>Sep 1, 2024</p>
      <nav role="navigation">
        <a href="/index.html">Home</a><a href="https://github.com/toyboot4e">GitHub</a>
      </nav>
    </header>
    <main role="main">
      <h2 id="ABC 369"><a href="#ABC 369">ABC 369</a></h2>
      <p><a href="https://atcoder.jp/contests/abc369">ABC 369</a> に参加しました。<br /></p>

      <table>
        <caption class="t-above">
          <span class="table-number">Table 1:</span>
          Diff 予想
        </caption>

        <colgroup>
          <col class="org-left" />

          <col class="org-right" />

          <col class="org-right" />

          <col class="org-right" />

          <col class="org-right" />

          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <thead>
          <tr>
            <th scope="col" class="org-left">問題</th>
            <th scope="col" class="org-right">A 問題</th>
            <th scope="col" class="org-right">B 問題</th>
            <th scope="col" class="org-right">C 問題</th>
            <th scope="col" class="org-right">D 問題</th>
            <th scope="col" class="org-left">E 問題</th>
            <th scope="col" class="org-left">F 問題</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td class="org-left">提出</td>
            <td class="org-right">AC</td>
            <td class="org-right">AC</td>
            <td class="org-right">AC</td>
            <td class="org-right">AC</td>
            <td class="org-left">AC</td>
            <td class="org-left">-</td>
          </tr>

          <tr>
            <td class="org-left">予想</td>
            <td class="org-right">50</td>
            <td class="org-right">400</td>
            <td class="org-right">500</td>
            <td class="org-right">500</td>
            <td class="org-left">1,500</td>
            <td class="org-left">1,200</td>
          </tr>

          <tr>
            <td class="org-left">実際</td>
            <td class="org-right">28</td>
            <td class="org-right">62</td>
            <td class="org-right">323</td>
            <td class="org-right">621</td>
            <td class="org-left">1,301</td>
            <td class="org-left">1,618</td>
          </tr>
        </tbody>
      </table>
      <h3 id="A 問題">
        <a href="#A 問題"><a href="https://atcoder.jp/contests/abc369/tasks/abc369_a">A 問題</a></a>
      </h3>
      <p>思い切って全探索する問題だと思いました。<br /></p>

      <div class="org-src-container">
        <pre><code class="src language-hs">import Data.List;main=interact$f.map read.words;f[a,b]=show$sum[1|x&lt;-[-300..300],(==1).length.nub.(zipWith(-)&lt;*&gt;tail)$sort[a,b,x]]
</code></pre>
      </div>
      <h3 id="B 問題">
        <a href="#B 問題"><a href="https://atcoder.jp/contests/abc369/tasks/abc369_b">B 問題</a></a>
      </h3>
      <p>
        入力で 1 行内に整数と文字が混じっているのが厄介です。
        <code>words &lt;$&gt; getLine</code> または、 <code>StateT</code> ベースのパーサがあれば合成
        (?) できます:<br />
      </p>

      <div class="org-src-container">
        <pre><code class="src language-hs">!ass &lt;- U.replicateM n $ (,) &lt;$&gt; int' &lt;*&gt; char'
</code></pre>
      </div>

      <p><code>(左手の位置, 右手の位置)</code> を持って畳み込みで解けました。<br /></p>

      <div class="org-src-container">
        <pre><code class="src language-hs">let !res = U.foldl' step s0 as
      where
        s0 = (-1 :: Int, -1 :: Int, 0 :: Int)
        step (!l, !r, !acc) (!i, 'L')
          | l == -1 = (i, r, acc)
          | otherwise = (i, r, acc + abs (i - l))
        step (!l, !r, !acc) (!i, 'R')
          | r == -1 = (l, i, acc)
          | otherwise = (l, i, acc + abs (i - r))
</code></pre>
      </div>

      <p>左手と右手は独立した問題なので、実装の共通化もできるようです。<br /></p>
      <h3 id="C 問題">
        <a href="#C 問題"><a href="https://atcoder.jp/contests/abc369/tasks/abc369_c">C 問題</a></a>
      </h3>
      <p>苦戦しました。差を取れば素直に RLE (run-length encoding) にできたようです。<br /></p>

      <p>Union-Find でも同じようなことができます。なるほど:<br /></p>

      <blockquote class="twitter-tweet">
        <p lang="ja" dir="ltr">
          C みたいな問題はこんな感じに UF で繋ぐとクソ楽にできる
          <a href="https://t.co/xmcUTBkSCH">pic.twitter.com/xmcUTBkSCH</a>
        </p>
        &mdash; あちゃぴ🍋 (@achapi_kyopuro)
        <a href="https://twitter.com/achapi_kyopuro/status/1829881170424934617?ref_src=twsrc%5Etfw"
          >August 31, 2024</a
        >
      </blockquote>
      <script async src="https://platform.twitter.com/widgets.js" charset="utf-8"></script>
      <h3 id="D 問題">
        <a href="#D 問題"><a href="https://atcoder.jp/contests/abc369/tasks/abc369_d">D 問題</a></a>
      </h3>
      <p>素直な DP です。畳み込みで解けます。<br /></p>

      <div class="org-src-container">
        <pre><code class="src language-hs">let (!r1, !r2) = U.foldl' step s0 xs
      where
        s0 = ((-1) :: Int, 0 :: Int)
        step (!accOdd, !accEven) x = dbgId (accOdd', accEven')
          where
            accOdd' = max accOdd (accEven + x)
            accEven'
              | accOdd == -1 = 0
              | otherwise = max accEven (accOdd + 2 * x)
 printBSB $ max r1 r2
</code></pre>
      </div>
      <h3 id="E 問題">
        <a href="#E 問題"><a href="https://atcoder.jp/contests/abc369/tasks/abc369_e">E 問題</a></a>
      </h3>
      <p>
        整理すると
        <a href="https://atcoder.jp/contests/abc369/submissions/57337838">短いコードになりました</a>
        。<br />
      </p>

      <p>学びの多い問題でした。<br /></p>
      <h4 id="Floyd–Warshall vs 全頂点 Dijkstra">
        <a href="#Floyd–Warshall vs 全頂点 Dijkstra">Floyd–Warshall vs 全頂点 Dijkstra</a>
      </h4>
      <p>
        計算量は \(O(V^3)\) vs \(O(V(E+V)\log V)\) で Dijkstra の方が小さい
        <strong>はず</strong> です。実際は、同程度の速さになりました。案外
        <strong>Floyd–Warshall の方が無難で良さそう</strong> です。<br />
      </p>
      <h4 id="盆栽要素"><a href="#盆栽要素">盆栽要素</a></h4>
      <p>ライブラリを整理しました。<br /></p>

      <ul>
        <li><code>vertor</code> 版 permutations (のバグ修正)<br /></li>
        <li>
          Floyd–Warshall<br />
          <ul>
            <li>
              自分自身への遷移 (<code>v -&gt; v</code>) をコスト <code>0</code> で初期化する<br />
            </li>
            <li>
              多重辺を正しく処理する<br />
              初期化で初回遷移を書き込む際に、単純な上書きではなく <code>min</code> で緩和する<br />
            </li>
          </ul>
        </li>
      </ul>
      <h3 id="F 問題">
        <a href="#F 問題"><a href="https://atcoder.jp/contests/abc369/tasks/abc369_f">F 問題</a></a>
      </h3>
      <p>
        LIS +
        経路復元の問題でした。最大値と共に親頂点の位置を記録します。最大値が更新される度に、経路復元用
        <code>Map</code> が持つ親の位置を更新します。<br />
      </p>

      <p>出力は <code>Bulider</code> を使うのが計算量の観点で無難です。<br /></p>
      <h2 id="Misc"><a href="#Misc">Misc</a></h2>
      <ul>
        <li>
          <a href="https://alpacahack.com/">Alpaca Hack</a> Round 2 (Web)<br />
          ちょっとだけやってみます。<br />
        </li>

        <li>
          <a
            href="https://www.kickstarter.com/projects/charachorder/the-master-forge-a-keyboard-built-for-you?ref=6fbf3o"
            >The Master Forge</a
          ><br />
          CharaChorder の新作キーボードの Kickstarter が出ました。すべてのキーがフリック入力で、
          chording (ステノタイプみたいな機能) が搭載されています。欲しいけれども、結局 Keyball
          に戻ってくるのも目に見えていて……？<br />
        </li>

        <li>
          <a href="https://github.com/haskell-suite/haskell-names">haskell-names</a><br />
          これで名前解決する bundler が作れそうですが、乗り気ではありません。<br />
          <ul>
            <li>
              <code>haskell-src-exts</code> べースです<br />
              最新の構文には対応できません。<br />
            </li>
            <li>
              <code>Environment</code> (名前空間の情報) を作る必要があります<br />
              AtCoder 環境のパッケージが export するシンボルをすべて
              <code>Environment</code> に載せる必要があり、自動化の検討が必要です。<br />
            </li>
          </ul>
        </li>
      </ul>
    </main>
    <footer role="contentinfo">
      <p>Styled with <a href="https://simplecss.org/">Simple.css</a></p>
      <div><a href="/index.html">Home</a><a href="https://github.com/toyboot4e">GitHub</a></div>
    </footer>
  </body>
</html>
